tap "alienator88/cask"
tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "shivammathur/extensions"
tap "shivammathur/php"
brew "cask"
brew "mas"

# GNU Tools
brew "coreutils"
brew "binutils"
brew "findutils"
brew "gnutls"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnupg"

# System
brew "bash"
brew "bash-completion"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "smartmontools"
brew "starship"

# web
brew "httpd", restart_service: true
brew "memcached", restart_service: true
brew "mysql", restart_service: true
brew "openssl@3"
brew "hugo"

# Development 
brew "node"
brew "php", restart_service: true
brew "shivammathur/extensions/imap@8.4"
brew "composer"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "go"
brew "gh"
brew "prettier"

# Images
brew "imagemagick"
brew "webp"
brew "jpeg-xl"

# Rust
brew "rust"
brew "dust"
brew "eza"

# Other
brew "aom"
brew "c-ares"
brew "icu4c@76"
brew "glib"
brew "cliclick"
brew "cloc"
brew "cmatrix"
brew "libssh2"
brew "freetds"
brew "libavif"
brew "gd"
brew "libzip"
brew "fortune"
brew "fzf"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "htop"
brew "shared-mime-info"
brew "libheif"
brew "inetutils"
brew "lesspipe"
brew "libfido2"
brew "libmemcached"
brew "librsvg"
brew "links"
brew "lolcat"
brew "macchina"
brew "nmap"
brew "pandoc"
brew "tealdeer"
brew "thefuck"
brew "tree"
brew "wget"
brew "zoxide"

# Fonts
cask "font-daddy-time-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"

#### GUI Apps

# Browsers
cask "brave-browser"
cask "firefox"

# Code Editors
cask "codeedit"
cask "obsidian"

# Development
cask "github"
cask "dbeaver-community"

# Image Editors
cask "affinity-photo"
cask "imageoptim"
cask "vscodium"

# Office
cask "onlyoffice"

# Social
cask "discord"

# Video
cask "vlc"
cask "radar"

# Other Apps
cask "backblaze"
cask "backblaze-downloader"
cask "betterdisplay"
cask "bitwarden"
cask "chatgpt"
cask "command-x"
cask "daisydisk"
cask "espanso"
cask "forticlient-vpn"
cask "hyperkey"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "logi-options+"
cask "malwarebytes"
cask "mission-control-plus"
cask "pearcleaner"
cask "qlmarkdown"
cask "rocket"
cask "skype"
cask "synologyassistant"
cask "timemachineeditor"
cask "windows-app"

# App Store
mas "Command X", id: 6448461551
mas "Controller", id: 1198176727
mas "Create File Menu", id: 1440519779
mas "Exporter", id: 1099120373
mas "FileZilla Pro", id: 1298486723
mas "Folder Preview", id: 6698876601
mas "Image Resizer", id: 1188274404
mas "Infuse", id: 1136220934
mas "Internet Status", id: 1039633009
# mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
# mas "Service Station", id: 1503136033
mas "SnailSVN", id: 847259925
mas "Speedtest", id: 1153157709
mas "Things", id: 904280696
